# <h1><center>Data Handling using Pandas<center><h1>

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\toshiba\anaconda3\lib\site-packages (1.4.4)
Requirement already satisfied: pytz>=2020.1 in c:\users\toshiba\anaconda3\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\toshiba\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.18.5 in c:\users\toshiba\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: six>=1.5 in c:\users\toshiba\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import numpy as np
import pandas as pd

# <h1><center>Data Structure in Pandas<center><h1>

# <h2><center>Series<center><h2>

# <h2><center>A data structure is a collection of data values and operations that can be applied to that data. It enables efficient storage, retrieval and modification to the data<center><h2>

# <h3><center>Creation of a series<center><h3>

# <h3><center>Creation of series from scalar values 
<center><h3>

In [3]:
pd1=pd.Series([1,2,3,4])

In [4]:
pd1

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
pd2=pd.Series([4,5,6,7])

In [6]:
pd2

0    4
1    5
2    6
3    7
dtype: int64

In [7]:
pd3=pd.Series(['Kavi','Ram','Shyam'],index=[3,5,1])

In [8]:
pd3

3     Kavi
5      Ram
1    Shyam
dtype: object

# <h3><center>Creation of series from numpy arrays 
<center><h3>

In [9]:
array1=np.array([1,2,3,4])

In [10]:
pd4=pd.Series(array1)

In [11]:
pd4

0    1
1    2
2    3
3    4
dtype: int32

In [12]:
pd5=pd.Series(array1,index=['Jan','Feb','March','April'])

In [13]:
pd5

Jan      1
Feb      2
March    3
April    4
dtype: int32

# <h3><center>Creation of Series from Dictionary<center><h3>

In [14]:
dict1={'India':'New Delhi','UK':'London','Japan':'Tokyo'}

In [15]:
pd6=pd.Series(dict1)

In [16]:
pd6

India    New Delhi
UK          London
Japan        Tokyo
dtype: object

# <h2><center>Indexing and Slicing in Series'<center><h2>

In [17]:
for i in range(1,7):
    print(f"pd{i}")
    print(eval(f"pd{i}"))
    print("---------------------")

pd1
0    1
1    2
2    3
3    4
dtype: int64
---------------------
pd2
0    4
1    5
2    6
3    7
dtype: int64
---------------------
pd3
3     Kavi
5      Ram
1    Shyam
dtype: object
---------------------
pd4
0    1
1    2
2    3
3    4
dtype: int32
---------------------
pd5
Jan      1
Feb      2
March    3
April    4
dtype: int32
---------------------
pd6
India    New Delhi
UK          London
Japan        Tokyo
dtype: object
---------------------

In [18]:
pd1[1]

2

In [19]:
pd2[3]

7

In [20]:
pd3[3]

'Kavi'

In [21]:
pd5['Jan']

1

In [22]:
SeriesCapCntry=pd.Series(['NewDelhi','WashingtonDC','London','Paris'],index=['India','UK','USA','France'])

In [23]:
SeriesCapCntry

India         NewDelhi
UK        WashingtonDC
USA             London
France           Paris
dtype: object

In [24]:
SeriesCapCntry[1]

'WashingtonDC'

In [25]:
SeriesCapCntry['India']

'NewDelhi'

In [26]:
SeriesCapCntry[['UK','USA']]

UK     WashingtonDC
USA          London
dtype: object

In [27]:
SeriesCapCntry[[2,3]]

USA       London
France     Paris
dtype: object

In [28]:
SeriesCapCntry[2:4]

USA       London
France     Paris
dtype: object

In [29]:
SeriesCapCntry[['UK','France']]

UK        WashingtonDC
France           Paris
dtype: object

In [30]:
SeriesCapCntry.index

Index(['India', 'UK', 'USA', 'France'], dtype='object')

In [31]:
SeriesCapCntry.values

array(['NewDelhi', 'WashingtonDC', 'London', 'Paris'], dtype=object)

In [32]:
SeriesCapCntry[1:4]

UK        WashingtonDC
USA             London
France           Paris
dtype: object

In [33]:
SeriesCapCntry['India':'USA']

India        NewDelhi
UK       WashingtonDC
USA            London
dtype: object

In [34]:
pd1[::-1]

3    4
2    3
1    2
0    1
dtype: int64

In [35]:
SeriesAlph=pd.Series(np.arange(10,16,1),index=['a','b','c','d','e','f'])

In [36]:
SeriesAlph

a    10
b    11
c    12
d    13
e    14
f    15
dtype: int32

In [37]:
SeriesAlph[1:3]

b    11
c    12
dtype: int32

In [38]:
SeriesAlph[1:3]=4

In [39]:
SeriesAlph

a    10
b     4
c     4
d    13
e    14
f    15
dtype: int32

# <h2><center>Attributes of a Series<center><h2>

In [40]:
SeriesCapCntry.name='Capitals'

In [41]:
SeriesCapCntry

India         NewDelhi
UK        WashingtonDC
USA             London
France           Paris
Name: Capitals, dtype: object

In [42]:
SeriesCapCntry.index.name='Countries'

In [43]:
SeriesCapCntry

Countries
India         NewDelhi
UK        WashingtonDC
USA             London
France           Paris
Name: Capitals, dtype: object

In [44]:
for i in range(1,7):
    print(f'The values and size of series pd{i} are',eval(f"pd{i}.values"),"and",eval(f"pd{i}.size"),'respectively')

The values and size of series pd1 are [1 2 3 4] and 4 respectively
The values and size of series pd2 are [4 5 6 7] and 4 respectively
The values and size of series pd3 are ['Kavi' 'Ram' 'Shyam'] and 3 respectively
The values and size of series pd4 are [1 2 3 4] and 4 respectively
The values and size of series pd5 are [1 2 3 4] and 4 respectively
The values and size of series pd6 are ['New Delhi' 'London' 'Tokyo'] and 3 respectively

In [45]:
pd1.empty

False

# <h3><center>Methods of a Series<center><h3>

In [46]:
SeriesTenTwenty=pd.Series(np.arange(10,20,1))

In [47]:
SeriesTenTwenty

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

In [48]:
SeriesTenTwenty.head(5)

0    10
1    11
2    12
3    13
4    14
dtype: int32

In [49]:
SeriesTenTwenty.tail(5)

5    15
6    16
7    17
8    18
9    19
dtype: int32

In [50]:
SeriesTenTwenty.count()

10

# <h3><center>Mathematical Operations on Series<center><h3>

In [51]:
SeriesA=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [52]:
SeriesA

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [53]:
SeriesB=pd.Series([-10,20,23,-90,88],index=['z','y','a','b','c'])

In [54]:
SeriesA+SeriesB

a    24.0
b   -88.0
c    91.0
d     NaN
e     NaN
y     NaN
z     NaN
dtype: float64

In [55]:
SeriesA-SeriesB

a   -22.0
b    92.0
c   -85.0
d     NaN
e     NaN
y     NaN
z     NaN
dtype: float64

In [56]:
SeriesA*SeriesB

a     23.0
b   -180.0
c    264.0
d      NaN
e      NaN
y      NaN
z      NaN
dtype: float64

In [57]:
SeriesA/SeriesB

a    0.043478
b   -0.022222
c    0.034091
d         NaN
e         NaN
y         NaN
z         NaN
dtype: float64

In [58]:
SeriesA.add(SeriesB,fill_value=1000)

a      24.0
b     -88.0
c      91.0
d    1004.0
e    1005.0
y    1020.0
z     990.0
dtype: float64

In [59]:
SeriesA.sub(SeriesB,fill_value=0)

a   -22.0
b    92.0
c   -85.0
d     4.0
e     5.0
y   -20.0
z    10.0
dtype: float64

In [60]:
SeriesA.mul(SeriesB,fill_value=19)

a     23.0
b   -180.0
c    264.0
d     76.0
e     95.0
y    380.0
z   -190.0
dtype: float64

In [61]:
SeriesA.div(SeriesB,fill_value=0)

a    0.043478
b   -0.022222
c    0.034091
d         inf
e         inf
y    0.000000
z   -0.000000
dtype: float64

In [62]:
SeriesA.sub(SeriesB,fill_value=1000)

a     -22.0
b      92.0
c     -85.0
d    -996.0
e    -995.0
y     980.0
z    1010.0
dtype: float64

In [63]:
SeriesA.mul(SeriesB,fill_value=10)

a     23.0
b   -180.0
c    264.0
d     40.0
e     50.0
y    200.0
z   -100.0
dtype: float64

# <h2><center>Data Frames<center><h2>

# <h3><center>A DataFrame is a two-dimensional labelled data structure like a table of MySQL. It contains rows and columns, and therefore has both a row and column index. Each column can have a different type of value such as numeric, string, boolean, etc., as in tables of a database<center><h3>

# <h3><center>Creation of DataFrame<center><h3>

# <h3><center> Creation of an empty DataFrame<center><h3>

In [64]:
dFrameEp=pd.DataFrame()

In [65]:
dFrameEp

Empty DataFrame
Columns: []
Index: []

In [66]:
type(dFrameEp)

pandas.core.frame.DataFrame

# <h3><center>Creation of DataFrame from NumPy ndarrays<center><h3>

In [67]:
array1

array([1, 2, 3, 4])

In [68]:
array2=np.array([3,4,5,6])
array3=np.array([4,6,8,10])

In [69]:
pd7=pd.DataFrame(array1)

In [70]:
pd7

   0
0  1
1  2
2  3
3  4

In [71]:
pd8=pd.DataFrame([array1,array2,array3])

In [72]:
pd8

   0  1  2   3
0  1  2  3   4
1  3  4  5   6
2  4  6  8  10

In [73]:
pd9=pd.DataFrame([array1,array2,array3],columns=['A','B','C','D'])

In [74]:
pd9

   A  B  C   D
0  1  2  3   4
1  3  4  5   6
2  4  6  8  10

# <h3><center>Creation of DataFrame from List of Dictionaries<center><h3>

In [75]:
listDict=[{'a':1,'b':2},{'a':6,'b':8}]

In [76]:
pd10=pd.DataFrame(listDict)

In [77]:
pd10

   a  b
0  1  2
1  6  8

In [78]:
listDict1=[{'a':1,'b':2},{'a':6,'b':8,'c':9}]

In [79]:
pd11=pd.DataFrame(listDict1)

In [80]:
pd11

   a  b    c
0  1  2  NaN
1  6  8  9.0

# <h3><center>Creation of DataFrame from Dictionary of Lists<center><h3>

In [81]:
Dictlist={'State':["Assam",'Delhi','Kerela'],'GeoArea':[2789,3124,4324],'VDF':[7.14,3.76,1.19]}

In [82]:
pd12=pd.DataFrame(Dictlist)

In [83]:
pd12

    State  GeoArea   VDF
0   Assam     2789  7.14
1   Delhi     3124  3.76
2  Kerela     4324  1.19

In [84]:
Dictlist={'State':["Assam",'Delhi','Kerela'],'GeoArea':[2789,3124,4324],'VDF':[7.14,3.76,1.19]}
pd13=pd.DataFrame(Dictlist,columns=['State','VDF','GeoArea'])

In [85]:
pd13

    State   VDF  GeoArea
0   Assam  7.14     2789
1   Delhi  3.76     3124
2  Kerela  1.19     4324

# <h3><center>Creation of DataFrame from Series<center><h2>

In [86]:
s1=pd.Series([4,3,4,5,5],index=['a','b','c','d','e'])

In [87]:
s2=pd.Series([2,4,6,2,7],index=['x','y','z','a','b'])

In [88]:
pd13=pd.DataFrame([s1,s2])

In [89]:
pd13

     a    b    c    d    e    x    y    z
0  4.0  3.0  4.0  5.0  5.0  NaN  NaN  NaN
1  2.0  7.0  NaN  NaN  NaN  2.0  4.0  6.0

In [90]:
resultSheet=pd.DataFrame({'Arnab':pd.Series([45,67,87],index=['English','Hindi','Mathematics']),'Arnab':pd.Series([90,78,57],index=['English','Hindi','Mathematics']),'Adnan':pd.Series([54,77,89],index=['English','Hindi','Mathematics']),'Ayesha':pd.Series([97,66,81],index=['English','Hindi','Mathematics'])})

In [91]:
resultSheet

             Arnab  Adnan  Ayesha
English         90     54      97
Hindi           78     77      66
Mathematics     57     89      81

In [92]:
pd14=pd.DataFrame({'Series1':pd.Series([1,2,3,5],index=['a','b','d','e']),"Series2":pd.Series([3,4,5,6],index=['x','y','a','b'])})

In [93]:
pd14

   Series1  Series2
a      1.0      5.0
b      2.0      6.0
d      3.0      NaN
e      5.0      NaN
x      NaN      3.0
y      NaN      4.0

# <h2><center> Operations on rows and columns in DataFrames<center><h2>

In [94]:
ResultDF=resultSheet

In [95]:
ResultDF

             Arnab  Adnan  Ayesha
English         90     54      97
Hindi           78     77      66
Mathematics     57     89      81

# <h3><center>Adding a New Column to a DataFrame<center><h3>

In [96]:
ResultDF['Preeti']=[98,88,76]

In [97]:
ResultDF

             Arnab  Adnan  Ayesha  Preeti
English         90     54      97      98
Hindi           78     77      66      88
Mathematics     57     89      81      76

In [98]:
ResultDF['Adiba']=[66,89,90]

In [99]:
ResultDF

             Arnab  Adnan  Ayesha  Preeti  Adiba
English         90     54      97      98     66
Hindi           78     77      66      88     89
Mathematics     57     89      81      76     90

# <h3><center>Adding a New Row to a DataFrame<center><h3>

In [100]:
ResultDF.loc['Science']=[90,87,90,100,81]

In [101]:
ResultDF

             Arnab  Adnan  Ayesha  Preeti  Adiba
English         90     54      97      98     66
Hindi           78     77      66      88     89
Mathematics     57     89      81      76     90
Science         90     87      90     100     81

# <h3><center>Deleting Rows or Columns from a DataFrame<center><h3>

In [102]:
ResultDF1=ResultDF.drop('Hindi',axis=0) #Will delete the rows and will not change permanently

In [103]:
ResultDF

             Arnab  Adnan  Ayesha  Preeti  Adiba
English         90     54      97      98     66
Hindi           78     77      66      88     89
Mathematics     57     89      81      76     90
Science         90     87      90     100     81

In [104]:
ResultDF.drop(['Ayesha','Adiba'],axis=1) #Will delete the columns and will not change permanently

             Arnab  Adnan  Preeti
English         90     54      98
Hindi           78     77      88
Mathematics     57     89      76
Science         90     87     100

# <h3><center>Renaming Row Labels of a DataFrame<center><h3>

In [105]:
ResultDF.rename({'English':'Bengali','Hindi':'Sanskrit'},axis=0) # to rows

             Arnab  Adnan  Ayesha  Preeti  Adiba
Bengali         90     54      97      98     66
Sanskrit        78     77      66      88     89
Mathematics     57     89      81      76     90
Science         90     87      90     100     81

In [106]:
ResultDF.rename({'Adnan':'Abhishek','Adiba':'Tuba'},axis=1) # to columns

             Arnab  Abhishek  Ayesha  Preeti  Tuba
English         90        54      97      98    66
Hindi           78        77      66      88    89
Mathematics     57        89      81      76    90
Science         90        87      90     100    81

In [107]:
ResultDF.rename({'Adnan':'Abhishek','Adiba':'Tuba'},axis='columns')

             Arnab  Abhishek  Ayesha  Preeti  Tuba
English         90        54      97      98    66
Hindi           78        77      66      88    89
Mathematics     57        89      81      76    90
Science         90        87      90     100    81

In [108]:
ResultDF.rename({'English':'Bengali','Hindi':'Sanskrit'},axis='index')

             Arnab  Adnan  Ayesha  Preeti  Adiba
Bengali         90     54      97      98     66
Sanskrit        78     77      66      88     89
Mathematics     57     89      81      76     90
Science         90     87      90     100     81

# <h3><center>Accessing DataFrames Element through Indexing<center><h3>

# <h4><center>(A) Label Based Indexing<center><h4>

In [109]:
ResultDF

             Arnab  Adnan  Ayesha  Preeti  Adiba
English         90     54      97      98     66
Hindi           78     77      66      88     89
Mathematics     57     89      81      76     90
Science         90     87      90     100     81

In [110]:
ResultDF.loc['Science']

Arnab      90
Adnan      87
Ayesha     90
Preeti    100
Adiba      81
Name: Science, dtype: int64

In [111]:
ResultDF['Adnan']

English        54
Hindi          77
Mathematics    89
Science        87
Name: Adnan, dtype: int64

In [112]:
ResultDF.loc['Science','Adnan']

87

In [113]:
ResultDF[['Ayesha',"Adnan"]]

             Ayesha  Adnan
English          97     54
Hindi            66     77
Mathematics      81     89
Science          90     87

In [114]:
ResultDF

             Arnab  Adnan  Ayesha  Preeti  Adiba
English         90     54      97      98     66
Hindi           78     77      66      88     89
Mathematics     57     89      81      76     90
Science         90     87      90     100     81

In [115]:
ResultDF.loc["English":'Mathmatics','Adnan':'Preeti']

             Adnan  Ayesha  Preeti
English         54      97      98
Hindi           77      66      88
Mathematics     89      81      76

In [116]:
dFrame10Multiples=pd.DataFrame([10,20,30,40],index=[2,3,4,7,])

In [117]:
type(dFrame10Multiples)

pandas.core.frame.DataFrame

In [118]:
dFrame10Multiples

    0
2  10
3  20
4  30
7  40

In [119]:
dFrame10Multiples.loc[4]

0    30
Name: 4, dtype: int64

# <h4><center>B) Boolean Indexing<center><h4>

In [120]:
ResultDF

             Arnab  Adnan  Ayesha  Preeti  Adiba
English         90     54      97      98     66
Hindi           78     77      66      88     89
Mathematics     57     89      81      76     90
Science         90     87      90     100     81

In [121]:
ResultDF.loc[:,'Arnab']>90

English        False
Hindi          False
Mathematics    False
Science        False
Name: Arnab, dtype: bool

In [122]:
ResultDF.loc['Mathematics',:]>90

Arnab     False
Adnan     False
Ayesha    False
Preeti    False
Adiba     False
Name: Mathematics, dtype: bool

# <h3><center>Filtering Rows in DataFrames<center><h3>

In [123]:
ResultDF

             Arnab  Adnan  Ayesha  Preeti  Adiba
English         90     54      97      98     66
Hindi           78     77      66      88     89
Mathematics     57     89      81      76     90
Science         90     87      90     100     81

In [124]:
ResultDF.loc[[True,False,True,False ],:]

             Arnab  Adnan  Ayesha  Preeti  Adiba
English         90     54      97      98     66
Mathematics     57     89      81      76     90

In [125]:
ResultDF.loc[[True,False,True,False ],[False,True,False,False,False]]

             Adnan
English         54
Mathematics     89

# <h2><center>Joining, Merging and Concatenation of DataFrames<center><h2>

In [126]:
dFrame1=pd.DataFrame([[1,2,3,4],[4,5,6,7]],columns=['C1','C2','C3','C4'],index=['R1','R2'])
dFrame2=pd.DataFrame([[2,3,4,5],[9,8,7,6]],columns=['C2','C4','C8','C9'],index=['R2','R3'])

In [127]:
dFrame1,dFrame2

(    C1  C2  C3  C4
 R1   1   2   3   4
 R2   4   5   6   7,
     C2  C4  C8  C9
 R2   2   3   4   5
 R3   9   8   7   6)

In [128]:
dFrame1.append(dFrame2)

C:\Users\TOSHIBA\AppData\Local\Temp\ipykernel_11932\1538218845.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dFrame1.append(dFrame2)

     C1  C2   C3  C4   C8   C9
R1  1.0   2  3.0   4  NaN  NaN
R2  4.0   5  6.0   7  NaN  NaN
R2  NaN   2  NaN   3  4.0  5.0
R3  NaN   9  NaN   8  7.0  6.0

In [129]:
dFrame2.append(dFrame1)

C:\Users\TOSHIBA\AppData\Local\Temp\ipykernel_11932\357663245.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dFrame2.append(dFrame1)

    C2  C4   C8   C9   C1   C3
R2   2   3  4.0  5.0  NaN  NaN
R3   9   8  7.0  6.0  NaN  NaN
R1   2   4  NaN  NaN  1.0  3.0
R2   5   7  NaN  NaN  4.0  6.0

In [130]:
dFrame2.append(dFrame1,sort=True)

C:\Users\TOSHIBA\AppData\Local\Temp\ipykernel_11932\2918747504.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dFrame2.append(dFrame1,sort=True)

     C1  C2   C3  C4   C8   C9
R2  NaN   2  NaN   3  4.0  5.0
R3  NaN   9  NaN   8  7.0  6.0
R1  1.0   2  3.0   4  NaN  NaN
R2  4.0   5  6.0   7  NaN  NaN

In [131]:
dFrame1.append(dFrame2,ignore_index=True)

C:\Users\TOSHIBA\AppData\Local\Temp\ipykernel_11932\922966555.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dFrame1.append(dFrame2,ignore_index=True)

    C1  C2   C3  C4   C8   C9
0  1.0   2  3.0   4  NaN  NaN
1  4.0   5  6.0   7  NaN  NaN
2  NaN   2  NaN   3  4.0  5.0
3  NaN   9  NaN   8  7.0  6.0

# <h3><center> Attributes of DataFrames<center><h3>

In [132]:
ForestArea = {
 'Assam' :pd.Series([78438, 2797, 
10192, 15116], index = ['GeoArea', 'VeryDense', 
'ModeratelyDense', 'OpenForest']),
 'Kerala' :pd.Series([ 38852, 1663, 
9407, 9251], index = ['GeoArea' ,'VeryDense', 
'ModeratelyDense', 'OpenForest']),
 'Delhi' :pd.Series([1483, 6.72, 56.24, 
129.45], index = ['GeoArea', 'VeryDense', 
'ModeratelyDense', 'OpenForest'])}

In [133]:
ForestArea

{'Assam': GeoArea            78438
 VeryDense           2797
 ModeratelyDense    10192
 OpenForest         15116
 dtype: int64,
 'Kerala': GeoArea            38852
 VeryDense           1663
 ModeratelyDense     9407
 OpenForest          9251
 dtype: int64,
 'Delhi': GeoArea            1483.00
 VeryDense             6.72
 ModeratelyDense      56.24
 OpenForest          129.45
 dtype: float64}

In [134]:
 ForestAreaDF = pd.DataFrame(ForestArea)

In [135]:
ForestAreaDF

                 Assam  Kerala    Delhi
GeoArea          78438   38852  1483.00
VeryDense         2797    1663     6.72
ModeratelyDense  10192    9407    56.24
OpenForest       15116    9251   129.45

In [136]:
ForestAreaDF.index

Index(['GeoArea', 'VeryDense', 'ModeratelyDense', 'OpenForest'], dtype='object')

In [137]:
ForestAreaDF.columns

Index(['Assam', 'Kerala', 'Delhi'], dtype='object')

In [138]:
ForestAreaDF.dtypes

Assam       int64
Kerala      int64
Delhi     float64
dtype: object

In [139]:
ForestAreaDF.values

array([[7.8438e+04, 3.8852e+04, 1.4830e+03],
       [2.7970e+03, 1.6630e+03, 6.7200e+00],
       [1.0192e+04, 9.4070e+03, 5.6240e+01],
       [1.5116e+04, 9.2510e+03, 1.2945e+02]])

In [140]:
ForestAreaDF.shape

(4, 3)

In [141]:
ForestAreaDF.size

12

In [142]:
ForestAreaDF.T

        GeoArea  VeryDense  ModeratelyDense  OpenForest
Assam   78438.0    2797.00         10192.00    15116.00
Kerala  38852.0    1663.00          9407.00     9251.00
Delhi    1483.0       6.72            56.24      129.45

In [143]:
ForestAreaDF.head(3)

                 Assam  Kerala    Delhi
GeoArea          78438   38852  1483.00
VeryDense         2797    1663     6.72
ModeratelyDense  10192    9407    56.24

In [144]:
ForestAreaDF.tail(2)

                 Assam  Kerala   Delhi
ModeratelyDense  10192    9407   56.24
OpenForest       15116    9251  129.45

In [145]:
ForestAreaDF.empty

False

In [146]:
ForestAreaDF

                 Assam  Kerala    Delhi
GeoArea          78438   38852  1483.00
VeryDense         2797    1663     6.72
ModeratelyDense  10192    9407    56.24
OpenForest       15116    9251   129.45

In [147]:
ForestAreaDF.loc[["GeoArea","VeryDense"],["Assam","Kerala"]]

           Assam  Kerala
GeoArea    78438   38852
VeryDense   2797    1663

In [148]:
ForestAreaDF.iloc[[1,2],[0,1]]

                 Assam  Kerala
VeryDense         2797    1663
ModeratelyDense  10192    9407

# <h3><center>Imprting a csv file to a dataframe<center><h3>

In [161]:
marks=pd.read_csv(r"C:\Users\TOSHIBA\OneDrive\Desktop\Pandas\Studentmarks.txt",delimiter=",",header=0)

In [162]:
marks

   RollNo             Name  Eco  Maths
0       1            Arnab   18     57
1       2          Kritika   23     45
2       3           Divyam   51     37
3       4           Vivaan   49     60
4       5           Aroosh   18     27
5       6            Adnan   16     78
6       7            Adiba   78    100
7       8            Arish   87     19
8       9  Muhammad Suhaib   90     18
9      10            Aliya   78     88

In [163]:
marks.iloc[[2,3],[1,2]]

     Name  Eco
2  Divyam   51
3  Vivaan   49

In [164]:
 marks["Hindi"]=[20,99,100,76,56,45,78,30,46,77]

In [178]:
marks.iloc[9]=[9,"Ayush Patel",89,19,90]

In [180]:
marks

   RollNo             Name Eco  Maths  Hindi
0       1            Arnab  18     57     20
1       2          Kritika  23     45     99
2       3           Divyam  51     37    100
3       4           Vivaan  49     60     76
4       5           Aroosh  18     27     56
5       6            Adnan  16     78     45
6       7            Adiba  78    100     78
7       8            Arish  87     19     30
8       9  Muhammad Suhaib  90     18     46
9       9      Ayush Patel  89     19     90

In [191]:
marks.drop(9,axis=0,inplace=True)

In [217]:
marks

   RollNo             Name Eco  Maths  Hindi
0       1            Arnab  18     57     20
1       2          Kritika  23     45     99
2       3           Divyam  51     37    100
3       4           Vivaan  49     60     76
4       5           Aroosh  18     27     56
5       6            Adnan  16     78     45
6       7            Adiba  78    100     78
7       8            Arish  87     19     30
8      10  Muhammad Zubair  90     10     91

In [218]:
marks.iloc[8]=[9,"Muhammad Zubair",90,10,91]

In [225]:
marks.loc[9]=[10,"Muhammad Arish",99,10,91]

In [226]:
marks

   RollNo             Name Eco  Maths  Hindi
0       1            Arnab  18     57     20
1       2          Kritika  23     45     99
2       3           Divyam  51     37    100
3       4           Vivaan  49     60     76
4       5           Aroosh  18     27     56
5       6            Adnan  16     78     45
6       7            Adiba  78    100     78
7       8            Arish  87     19     30
8       9  Muhammad Zubair  90     10     91
9      10   Muhammad Arish  99     10     91

In [227]:
marks.loc[10]=[11,"Adeel Arish",89,19,69]

In [228]:
marks

    RollNo             Name Eco  Maths  Hindi
0        1            Arnab  18     57     20
1        2          Kritika  23     45     99
2        3           Divyam  51     37    100
3        4           Vivaan  49     60     76
4        5           Aroosh  18     27     56
5        6            Adnan  16     78     45
6        7            Adiba  78    100     78
7        8            Arish  87     19     30
8        9  Muhammad Zubair  90     10     91
9       10   Muhammad Arish  99     10     91
10      11      Adeel Arish  89     19     69

In [ ]:
mar